app/views/users/show.html.erb

SELECT "orgs".* FROM "orgs" WHERE "orgs"."user_id" = 1
SELECT COUNT(*) FROM "orgs" WHERE "orgs"."user_id" = 1
---

<% if @user.orgs.empty? %>