app/controllers/comments_controller.rb

  def create
    @comment = @commentable.comments.new(params[:comment])

    @comment.user_id = current_user.id
    #@comment.org_id = @id # org_id not used anymore, using polymorphic now
    @comment.commenter = current_user.name

    if @comment.save
---
INSERT INTO "comments" ("body", "commentable_id", "commentable_type", "commenter", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"