app/controllers/orgs_controller.rb

  def index
    @orgs = Org.paginate(page: params[:page], per_page: 10, :order => "created_at DESC")
---
SELECT "orgs".* FROM "orgs" ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orgs"

  def show
    @org = Org.find(params[:id])
---
SELECT "orgs".* FROM "orgs" WHERE "orgs"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @org = Org.find(params[:id])
---
SELECT "orgs".* FROM "orgs" WHERE "orgs"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @org = current_user.orgs.create(params[:org])
---
INSERT INTO "orgs" ("created_at", "description", "followers", "industry", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @org = Org.find(params[:id])
---
SELECT "orgs".* FROM "orgs" WHERE "orgs"."id" = $1 LIMIT 1  [["id", "1"]]

  def destroy
    @org = Org.find(params[:id])
    @org.destroy
---
SELECT "orgs".* FROM "orgs" WHERE "orgs"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "orgs" WHERE "orgs"."id" = $1  [["id", 2]]