app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."commenter" = 'minghua'
---
  def show
    @user = User.find(params[:id])
    @all_comments = Comment.find_all_by_commenter(@user.name)

INSERT INTO "users" ("admin", "created_at", "email", "following_org_id", "name", "password_digest", "password_reset_sent_at", "password_reset_token", "remember_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
      @users = User.paginate(page: params[:page]) #paginate limit per_page defaults to 30